In [1]:
# Dependencies
import pandas as pd

In [13]:
pd.DataFrame([
    [1, 2, 3],
    [4,2,1],
    [8,7,4]
], columns=["a", "b", "c"])

   a  b  c
0  1  2  3
1  4  2  1
2  8  7  4

In [10]:
pd.DataFrame({
    "Head":[1, 2, 3],
    "Tail":[4,2,1],
    "other": [8,7,4]
})

   Head  Tail  other
0     1     4      8
1     2     2      7
2     3     1      4

In [5]:
["UCLA", "UC Berkeley", "UC Irvine",
                         "University of Central Florida", "Rutgers University"]

['UCLA',
 'UC Berkeley',
 'UC Irvine',
 'University of Central Florida',
 'Rutgers University']

In [14]:
# We can create a Pandas Series from a raw list
data_series = pd.Series(
    [
        "UCLA", "UC Berkeley", "UC Irvine",
        "University of Central Florida", "Rutgers University"
    ]
)
data_series

UCLA                                                      UCLA
UC Berkeley                                        UC Berkeley
UC Irvine                                            UC Irvine
University of Central Florida    University of Central Florida
Rutgers University                          Rutgers University
dtype: object

In [11]:
# Convert a list of dictionaries into a DataFrame
states_dicts = [
    {
        "STATE": "New Jersey",
        "ABBREVIATION": "NJ"
    },
    {
        "STATE": "New York",
        "ABBREVIATION": "NY"
    }
]

states_df = pd.DataFrame(states_dicts)
states_df

        STATE ABBREVIATION
0  New Jersey           NJ
1    New York           NY

In [12]:
# Convert a single dictionary containing lists into a DataFrame
pharaoh_df = pd.DataFrame(
    {
        "Dynasty": ["Early Dynastic Period", "Old Kingdom"],
        "Pharaoh": ["Thinis", "Memphis"]
    }
)
pharaoh_df

                 Dynasty  Pharaoh
0  Early Dynastic Period   Thinis
1            Old Kingdom  Memphis